import os
os.environ["JAVA_HOME"] = r"D:\Java\jdk-11.0.4"

from pyhanlp import *


print(HanLP.segment(u'我他妈的太爱自然语言处理了。'))
print(HanLP.parseDependency(u'我他妈的太爱自然语言处理了。'))

report="""铁矿在经过前一阶段的盘整后，今日又重回跌势，基本面较上周并无较大变动，上周日均疏港量和港口库存量的下滑更多的还是受台风影响，并不反应真正的市场供需强弱。本轮下调的主要原因或来自于消息面，近日在山东发现3处铁矿区，矿石全铁品位达55.97%，磁铁品位达49.32%，最高全铁品位达66.46%，这对我国长久以来一直缺少的铁含量超过50%的富铁矿资源是一项主要的补充，加剧了市场对后市国产矿供应进一步宽松的预期。

当前市场对下半年外矿供应不断增加的预期已基本达成共识并不断消化，但考虑到其产量和发运量的恢复并非一蹴而就，短期港口库存仍较难累积，其对价格的影响主要还是体现在远期合约，近期铁矿走势仍将由需求端主导。市场当前对国庆前的环保限产力度和进入传统旺季后下游需求端的释放情况分歧较大。从7.8月份河北地区的环保限产的效果来看，其对全国总体钢厂产量和开工率的影响并不及预期，在利润尚可的情况下，非限产区开工仍然积极，故对后续国庆前的环保限产效果也不应有过高期待。终端需求方面，现在部分工地开始陆续出现备货现象，下游需求开始逐渐转暖，政策方面近期也接连托底，维稳力度较强。新机制下的贷款市场报价利率LPR迎来首次报价，一年期LPR利率为4.25%，较此前的4.31%下行6bp，五年期LPR利率为4.85%。基准利率的下调将有效缓解实体企业当前的资金困境，对后续钢材消费将有一定的提振。考虑到当前宏观经济依然承压，后续财政政策也可能会继续发力，地方政府专项债额度很有可能增加，对后续基建形成支撑。总体而言进入旺季后对需求端不应过分悲观。钢厂在现在低利润的情况下产量和开工率依然居高不下，而且钢厂的进口铁矿石库存仍然维持在较低位置，后续一旦需求端转好，利润回暖，补库力度仍不可小视。即便后市需求不及预期，考虑到前期铁矿石价格的连续下挫已经使得原料端的跌幅大于成材端，钢厂利润被动回暖，短期对铁矿石的价格也将形成支撑。

总体看，铁矿全年供应最紧张的时刻已经过去，全年价格高点已现，经过前一段的连续下调，最恐慌时刻也已经趋近尾声，后市长期看将呈现逐步震荡走弱趋势，但短期仍不宜过度悲观。01合约当前位置有超跌之嫌，其价格已经低于部分国产矿和非主流矿价格，成本端支撑力度预期较强，下行空间有限，未来仍会有修复需求，暂不宜继续沽空，短期仍需密切关注钢厂去库情况，待终端需求出现好转迹象后可逐步布局01合约多单。"""


#
# 2、美国《Tire business》发布2019全球轮胎企业75强排行榜。榜单显示，全球轮胎头部企业排名变化不大，世界轮胎格局基本稳定。但受市场影响，榜单下游企业变化剧烈。前10名排行仅一处变动据了解，这次发布的75强榜单，是按企业2018年的轮胎销售额进行排名。排在榜单前10位的，依次是普利司通、米其林、固特异、德国马牌、住友橡胶、倍耐力、韩泰轮胎、优科豪马、中策橡胶，以及正新橡胶。相比去年，今年前10的排名中，出现了一处变化。原排名第10位的中策橡胶，以微弱优势超过正新，列在第9位。
#
# 观点及投资建议
#
# 1-9价差截至夜盘收盘至990元/吨。RU2001-NR2002收至1785元/吨，RU2005-NR2005收至1750元/吨。
#
# 宏观方面中美贸易局势有所缓解提高了市场信心，在目前全球宽松货币政策背景下，更多资金流向市场；国家外汇管理局决定取消合格境外机构投资者（QFII）和人民币合格境外机构投资者（RQFII）投资额度限制，这一举措将进一步扩大金融市场对外开放程度，推动人民币资产的国际配置，长期利好A股市场，提振市场信心。沪胶基本面变化不大，需求乏善可陈。09合约面临交割压力，较弱，01有阶段性做多机会，偏强；近远月互相牵制，都难走远。预计日内主力合约震荡整理为主。'''
print(HanLP.extractSummary(report, 3))
